; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	spectrograph5 - mode
	spectrograph7 - mode
	thermograph3 - mode
	image1 - mode
	thermograph2 - mode
	image0 - mode
	infrared4 - mode
	spectrograph6 - mode
	Star4 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph6)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image0)
	(supports instrument2 spectrograph6)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument3 thermograph3)
	(supports instrument3 image0)
	(supports instrument3 spectrograph5)
	(supports instrument3 infrared4)
	(supports instrument3 image1)
	(supports instrument3 spectrograph7)
	(calibration_target instrument3 Star3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(supports instrument4 thermograph3)
	(supports instrument4 spectrograph5)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet11)
)
(:goal (and
	(pointing satellite0 Star3)
	(pointing satellite2 Phenomenon7)
	(have_image Phenomenon5 infrared4)
	(have_image Planet6 image1)
	(have_image Phenomenon7 spectrograph7)
	(have_image Phenomenon7 image0)
	(have_image Planet8 spectrograph7)
	(have_image Star9 thermograph3)
	(have_image Star9 spectrograph6)
	(have_image Planet10 image1)
	(have_image Planet11 thermograph3)
	(have_image Planet11 infrared4)
))

)

; plan
1. (turn_to satellite1 star3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star3)
   goals met: 0 of 12
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 12
3. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 0 of 12
4. (turn_to satellite1 planet10 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet10)
   goals met: 0 of 12
5. (take_image satellite1 planet10 instrument3 image1)
   added: (have_image planet10 image1)
   goals met: 1 of 12
6. (turn_to satellite1 phenomenon5 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon5)
   goals met: 1 of 12
7. (turn_to satellite0 groundstation2 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 groundstation2)
   goals met: 1 of 12
8. (take_image satellite1 phenomenon5 instrument3 infrared4)
   added: (have_image phenomenon5 infrared4)
   goals met: 2 of 12
9. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 12
10. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 2 of 12
11. (turn_to satellite0 star9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star9)
   goals met: 2 of 12
12. (take_image satellite0 star9 instrument1 spectrograph6)
   added: (have_image star9 spectrograph6)
   goals met: 3 of 12
13. (turn_to satellite0 star3 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star3)
   goals met: 4 of 12
14. (turn_to satellite1 phenomenon7 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon7)
   goals met: 4 of 12
15. (take_image satellite1 phenomenon7 instrument3 image0)
   added: (have_image phenomenon7 image0)
   goals met: 5 of 12
16. (take_image satellite1 phenomenon7 instrument3 spectrograph7)
   added: (have_image phenomenon7 spectrograph7)
   goals met: 6 of 12
17. (turn_to satellite1 planet11 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet11)
   goals met: 6 of 12
18. (take_image satellite1 planet11 instrument3 infrared4)
   added: (have_image planet11 infrared4)
   goals met: 7 of 12
19. (take_image satellite1 planet11 instrument3 thermograph3)
   added: (have_image planet11 thermograph3)
   goals met: 8 of 12
20. (turn_to satellite1 planet6 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet6)
   goals met: 8 of 12
21. (take_image satellite1 planet6 instrument3 image1)
   added: (have_image planet6 image1)
   goals met: 9 of 12
22. (turn_to satellite1 planet8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet8)
   goals met: 9 of 12
23. (take_image satellite1 planet8 instrument3 spectrograph7)
   added: (have_image planet8 spectrograph7)
   goals met: 10 of 12
24. (turn_to satellite1 star9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star9)
   goals met: 10 of 12
25. (take_image satellite1 star9 instrument3 thermograph3)
   added: (have_image star9 thermograph3)
   goals met: 11 of 12
26. (turn_to satellite2 phenomenon7 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon7)
   goals met: 12 of 12
